{"url": "https://www.bbc.com/news/uk-england-hampshire-44715995?intlink_from_url=", "title": "Accused coach treated boys 'like family'", "description": "Former Southampton football coach Bob Higgins denies abusing 24 boys, many of them trainees.", "content": "A former football coach accused of sexually abusing boys has told a court he treated his trainees \"like family\".\n\nBob Higgins denies abusing 24 boys, many of them trainees at Southampton and Peterborough United.\n\nThe 65-year-old told Winchester Crown Court he probably \"put his arm round\" boys but nothing \"inappropriate\" took place when they stayed at his home.\n\nHe also told the court that he had never been alone in a car with a trainee.\n\nMr Higgins said players sometimes stayed with him in Southampton so they could do extra training on weekends.\n\n\"Did you ever have a lad on your knee?\" defence barrister Alistair MacDonald QC asked the former coach.\n\n\"We've heard of boys snuggling up to you. Did that happen?\" Mr MacDonald said.\n\nThe defendant said boys would sit wherever he did, but nothing \"inappropriate\" took place.\n\nPreviously complainants told the court they were groped by Mr Higgins in his car while love songs were playing on the stereo.\n\nMr MacDonald asked if there was an \"ulterior purpose\" for the selection of songs by Whitney Houston, Celine Dion and The Stylistics to \"engender an atmosphere\".\n\n\"They were top of the charts at the time. I loved the music,\" Mr Higgins replied.\n\nHe also described how he obtained the idea of giving \"soapy water massages\" from a television show about the Leeds United and England manager Don Revie.\n\nThe jury, which had heard allegations of abuse during the massages given by Mr Higgins, was shown a YouTube clip of the Don Revie Story which showed the players being given massages.\n\n\"At any stage, was the intention to derive sexual pleasure for you?\" Mr MacDonald asked the defendant.\n\n\"No,\" Mr Higgins replied, adding that he might have unintentionally brushed boys' private parts with his hands.\n\nMr MacDonald said the court had previously heard from some trainees that they had never had those type of massages anywhere else.\n\nThe barrister asked Mr Higgins why he befriended trainees' parents.\n\n\"It has been suggested you deliberately cultivated the parents so boys couldn't complain to them,\" the barrister said.\n\nThe defendant told the jury that it had been his job to \"sell\" Southampton to the families of talented players, and see off competition from other clubs.\n\nHe recalled that players dropped their shorts for a \"hairy bum competition\" at a residential training camp, but said there was no \"sexual motive\" and coaches took no part in organising it.\n\nThe defendant said he began to recruit and train boys with support from Crystal Palace and later, from 1972, Southampton.\n\n\"Football was the most important thing in my life,\" he told the court.\n\nHe denies 50 counts of indecent assault against teenage boys.\n\nThe charges, dating between 1971 and 1996, arose after the NSPCC set up a dedicated helpline to deal with sexual abuse in football, the court previously heard."}