{"url": "https://www.bbc.com/news/world-europe-39442098", "title": "Ronaldo sculptor defends his bizarre work", "description": "Emanuel Santos says his statue of the football player unveiled in Madeira is \"a matter of taste\".", "content": "The sculptor behind a statue of Cristiano Ronaldo that left football fans scratching their heads has said his work is just \"a matter of taste\".\n\nEmanuel Santos said the bust, unveiled on the Portuguese island of Madeira, was \"not as simple as it seems\" to create.\n\nThe unveiling of the Ronaldo statue led many on social media to question the work's resemblance to the player.\n\nIt was revealed at a ceremony to name the island's airport after him.\n\n\"It is impossible to please the Greeks and Trojans. Neither did Jesus please everyone,\" Mr Santos said.\n\nHe said that his creation was \"not as simple as it seems\" to produce, adding that it took him 15 days to complete and that the finished item \"was a matter of taste\", the Guardian newspaper reports.\n\n\"Cristiano saw the photos that his brother sent him,\" Mr Santos told broadcaster Globo.\n\n\"I was with his brother at Cristiano's museum in Madeira and from the messages he sent, I could tell that he liked what he saw,\" he said.\n\nMr Santos said that Ronaldo had asked him to make minor changes in order to make the player look younger.\n\n\"He only asked for some wrinkles that gave him a certain expression in his face when he's about to laugh to be changed,\" he said.\n\nOn Wednesday, Mr Santos told Portuguese TV channel RTP that he had not yet had the opportunity to talk to Ronaldo personally since the unveiling, but said that he would \"reach out to him to know his feedback\".\n\n\"It's always a great honour to work on a project like that,\" he said.\n\nHowever, shortly after the sculpture was revealed on Wednesday, it was mocked on the social media site Twitter.\n\n\"They got the Adams Apple [sic] and the hair right. That's something,\" wrote Ryan Post‏. \"Creepy!\" added Mel Bishop‏.\n\nSome even suggested that the sculpture looks more like the former Republic of Ireland captain Niall Quinn.\n\nPortuguese President Rebelo de Sousa said Ronaldo \"projects Madeira and Portugal across the world far more than anybody else\".\n\nThe 32-year-old forward is a local hero in Madeira, where he is seen as a rags-to-riches success. He already has a museum about him in his hometown of Funchal.\n\nThe player later said on Twitter: \"Happy and honoured to have my name given to the Madeira airport!\"\n\nRonaldo is not the first footballer to have an airport named after him. Belfast airport was named after former Manchester United player George Best in 2006, a year after he died.\n\nPortugal's president and the prime minister flew to Madeira to unveil the tribute.\n\nThe sculpture will remain on permanent display outside the terminal entrance."}