{"url": "https://www.bbc.com/sport/football/37331224", "title": "Champions League: Barcelona 7-0 Celtic", "description": "Celtic sustain their worst defeat ever in European competition as they are hammered by rampant Barcelona at the Nou Camp.", "content": "Lionel Messi scored his sixth Champions League hat-trick as rampant Barcelona inflicted on Celtic their heaviest ever European defeat.\n\nThe Argentina forward cracked in an early first goal in the Group C match.\n\nCeltic's Moussa Dembele had a penalty saved before Messi poked in his second.\n\nIn the second half, Neymar's free-kick sailed into the net, Andres Iniesta volleyed a fourth, Messi slid home the fifth and Luis Suarez scored with a volley and then a side-footed finish.\n\nIn their two full seasons together at the Nou Camp, Messi, Neymar and Suarez have scored a combined 253 goals and assisted 120 more.\n\nThose numbers are rising quickly in the early weeks of this season - 266 goals and 128 assists - and in this latest masterclass, Messi got a hat-trick and Neymar a goal and four assists.\n\nThey are - more often than not - unplayable. All of the weaknesses in Celtic's make-up - and there were so many - were ruthlessly exposed.\n\nMessi scored after just three minutes when Neymar slid the ball through a spooked defence.\n\nCeltic won a penalty against the run of play when Dembele was brought down by Marc-Andre ter Stegen, but the striker had his effort saved by the Barcelona goalkeeper.\n\nAfter that, the floodgates opened.\n\nMessi's second came after he and Neymar combined to bamboozle the Celtic defence, Messi walking it in for number two. Barca's speed of thought and movement was delicious. Football, yes, but not as anybody in Scotland knows it.\n\nNeymar's 50th-minute free-kick made it three, Celtic goalkeeper Dorus de Vries getting a touch but not a big enough touch. De Vries should have done better.\n\nThe torture just got worse. Iniesta came on at the break and scored the fourth, thumping Neymar's cross on the volley past De Vries.\n\nCeltic's brains were spinning. Within 76 seconds the fifth had arrived, Suarez putting it into the box for Messi to slide in for his hat-trick goal.\n\nSuarez added the sixth, taking down Neymar's dinked pass on his chest before turning and rifling it home.\n\nThis was Celtic's heaviest ever defeat in Europe even before Messi assisted once again for the seventh, which Suarez. scored.\n\nCeltic are just another in a long line of Barca victims. The Catalans have done this kind of thing to so many teams in the recent past and that is the only consolation for the visitors.\n\nCeltic manager Brendan Rodgers said on Monday that great players always find space no matter what their opponents try to do to stop them.\n\nBarca had the freedom of the Nou Camp - and they revelled in it to make Celtic suffer."}