{"url": "https://www.bbc.com/sport/snooker/17245308", "title": "Mark Allen to face Stephen Lee in World Open final", "description": "Mark Allen fights back to defeat Mark Selby 6-5, while Stephen Lee ousts Robert Milkins 6-2 in the semi-finals of the World Open.", "content": "Mark Allen earned a dramatic 6-5 semi-final win over Mark Selby at the Haikou World Open in China after winning the final four frames of the contest.\n\nAllen, facing possible disciplinary action after criticism of the tournament venue this week, looked beaten as Selby forged a 5-2 lead.\n\nHowever, breaks of 80, 79 and 71 helped Allen to force a deciding frame and he clinched victory with a run of 112.\n\nIn Sunday's final he will play Stephen Lee, who beat Robert Milkins 6-2.\n\nUK Championship finalist Allen made headlines on Thursday when he criticised conditions as \"horrendous\" after his 5-4 win over Judd Trump.\n\nAllen followed that with more Twitter comments on Friday when he complained about high temperatures in the tournament arena during his win over Mark King.\n\nHowever, Allen avoided any further controversy in the immediate aftermath of his win over Selby.\n\n\"It's very, very good to get through as any win against Mark Selby is a good win,\" Allen told worldsnooker.com.\n\n\"But to come from 5-2 behind is even better and the way I played in the last four frames would be worthy of winning any match.\"\n\nWorld number one Selby had looked in command, leading 3-1 and then 5-2, compiling a couple of centuries in the process before Allen's comeback.\n\n\"Hopefully I can now go on and win the tournament as to have played like that and not go on and win would be very disappointing,\" added the Antrim left-hander.\n\nSelby put his own disappointment to one side as he praised Allen after the match.\n\n\"To be fair to Mark he played very well from 5-2 and I don't think I had a single chance to win the match,\" added the Leicester man.\n\n\"I'm amazed he hasn't won a tournament by now as he's such a great player.\"\n\nLee on the other hand, had a far more straight-forward contest as he booked his place in the final.\n\nDespite Milkins taking the first frame, and then squaring the game 2-2 at the mid-session interval, he was unable to stop Lee dominating the final stages with breaks of 85, 61 and 76.\n\n\"I'm quietly confident and that comes from playing week in, week out and I wouldn't be here if I didn't think I could win it,\" said Lee, who will be competing for his fifth ranking title.\n\n\"I've played Mark Allen many times and they're always good matches. It's nice to get to a final and Mark will be bang up for his first ranking title.\"\n\nMilkins, who caused an upset when he dispatched world number six John Higgins in the quarter-final on Friday, admitted that his performance levels had dropped overnight.\n\n\"My mindset wasn't very good tonight, even before I went on,\" he said.\n\n\"It was quite hard playing Steve as we've known each a long time but if you're not on top of your game, you don't beat the top players. I can't expect to have won playing like I did.\n\n\"I should be higher up the rankings than I am but when you play like I played tonight, it makes you wonder what future you've got.\""}