{"url": "https://www.bbc.com/sport/snooker/13262291", "title": "World Snooker: Pundits & players hail champion Higgins", "description": "\"John is the greatest player I have ever seen,\" says Steve Davis", "content": "John Higgins became world champion for the fourth time with his 18-15 win over Judd Trump.\n\nHere, pundits and players praise the performances of both finalists.\n\n\"John Higgins has got a new target after winning his fourth crown - and that target is my seven world titles.\n\n\"I always had a target. Steve Davis had won six and that was my target; it's always easier when you've got something to go for.\n\n\"The problem for me was that I made seven and then there was nobody else. Subconsciously, it makes you take your foot off the gas. But let's see how John gets on with his target.\n\n\"It really has been the ultimate rollercoaster year for him.\n\n\"From being down and everyone talking about him, saying it was the end of his career [with the match-fixing scandal], then being proved innocent [after his six-month ban] and his dad passing away.\n\n\"I wasn't surprised at all when he came back to win his first tournament after his ban [a European Tour Championship event in Germany] - he's simply one of the best players in the world and what he's done has been phenomenal.\n\n\"To win three major titles in the second half of the season shows just what a fantastic player he is.\"\n\n\"Judd Trump lit up the World Championship but John Higgins has gone away with the spoils.\n\n\"John is the greatest player I have ever seen and he thoroughly deserved to win. I think only John Higgins could have beaten Judd Trump today.\n\n\"As for Judd... Ronnie O'Sullivan is a genius at the snooker table but I have to say this guy Trump made my jaw drop more than anyone I remember.\"\n\n\"The way John Higgins plays the game, I am not surprised he has won a a fourth world title and he can definitely win it again. He is just an unbelievable match player.\n\n\"He is so hard, so determined. There were a couple of matches [his quarter-final against Ronnie O'Sullivan, when he trailed 8-5 but won 13-10, and his semi-final against Mark Williams, when he trailed 9-5 but won 17-14] when he was down and out and looked like he was going home but he just refused to be beaten.\n\n\"Trump has been a breath of fresh air right from the start. I didn't think he was this good, I have to be honest. He has been absolutely astounding in this tournament.\"\n\nThree-time world champion Ronnie O'Sullivan: \"Great final... Well done to John... But Judd should be happy with how his tournament went.\"\n\n2010 champion Neil Robertson: \"Unbelievable performance from both players, Judd will have his day I'm sure. Despite all the talent in the modern game, John Higgins is clearly the greatest player of all time.\""}