{"url": "https://www.bbc.com/sport/football/22781769", "title": "Brentford: Chief executive Mark Devlin aims to grow fan base", "description": "Chief executive Mark Devlin says Brentford must attract new fans before they move to their planned new stadium in 2016.", "content": "Brentford chief executive Mark Devlin says the club must attract new supporters before they move into their new 20,000-seater stadium.\n\nThe west London club submitted a planning application for a new ground at Lionel Road last week and hope to move in by July 2016.\n\nDevlin told BBC London 94.9: \"We have got a lot of work to do between now and 2016 in building the fan base.\n\n\"From the club's point of view it is the biggest challenge we have got.\"\n\nBrentford's average league attendance at the 12,763-capacity Griffin Park last season was 6,302 and the club had originally mooted building a 15,000-capacity ground.\n\nHowever, Devlin feels revising the plans for the new 7.6 acre site, which the club purchased last summer, is the correct decision.\n\n\"It is certainly right for us at this moment in time,\" Devlin added.\n\n\"The idea behind the 20,000 [application] is that it allows us to create a business and a football club which is sustainable.\n\n\"Any lower than that, and it would be tough to argue the business case.\"\n\nHe continued: \"In an area that has got a number of other clubs very locally to us, we will have to work very hard for the hearts and minds of young families.\n\n\"The new stadium will allow us to attract some of those floating voters and new fans that Griffin Park doesn't.\"\n\nBrentford hope to receive planning permission from Hounslow Council by September or October and envisage commencing works at the site next summer.\n\nDevlin reiterated that they would be open to a sharing the stadium as they look to increase their non-matchday revenue.\n\n\"Griffin Park only allows us to generate revenue on the 25 or 26 days which we hold football matches there,\" he said.\n\n\"We have said all along we would welcome the opportunity to talk with Premiership rugby clubs that may be interested in moving to a new stadium.\n\n\"There are ongoing discussions we have had with a number of clubs. Whether they will lead anywhere we really don't know but it is a distinct possibility.\n\n\"The council would be very excited by having a Premiership rugby side there, alongside a very ambitious football club, and it would provide a strong heartbeat for the community.\""}