{"url": "https://www.bbc.com/sport/tennis/14597414", "title": "Rafael Nadal and Roger Federer lose in Cincinnati", "description": "Both Rafael Nadal and Roger Federer are out of the Western & Southern Open in Cincinnati after quarter-final defeats but Novak Djokovic continues his winning form.", "content": "Both Rafael Nadal and Roger Federer are out of the Western & Southern Open in Cincinnati after quarter-final defeats.\n\nNadal lost in straight sets, 6-3 6-4 to American Mardy Fish, who will meet Andy Murray in the semi-finals after the Briton's win over Gilles Simon.\n\nFederer also lost in straight sets, 6-2 7-6 (7-3) to Tomas Berdych.\n\nBerdych will meet Novak Djokovic in the last four after the world number one beat Gael Monfils 3-6 6-4 6-3.\n\nIn the women's draw, Maria Sharapova booked a last-four meeting with Vera Zvonareva.\n\nAndrea Petkovic is also through after beating Nadia Petrova 7-5 6-1, and will take on 13th seed Jelena Jankovic for a spot in the final.\n\nJankovic progressed when her quarter-final opponent Shuai Peng of China withdrew from the tournament with a sore left hip.\n\nNadal, after a marathon battle with Fernando Verdasco in the previous round, struggled to keep pace with Fish, the seventh seed who has not lost a service game en route to the semis.\n\nThe Spanish world number two, playing with his right index and middle fingers heavily bandaged after burning them on a hotplate at a restaurant, had also followed the victory over Verdasco with a 70-minute doubles match.\n\nFish took advantage of the travails of his opponent, manoeuvring him around the court and patiently waiting for errors, sealing his second consecutive Cincinnati semi-final with a forehand pass from the baseline.\n\nAfterwards Nadal said: \"It was a little bit [of an] unlucky week for me with the burned fingers and the very long match yesterday. I didn't have a lot of feeling when I threw the ball with the right hand and the backhand too.\n\n\"I lost because Mardy played much better than me.\"\n\nFederer, unbeaten in the Ohio tournament since 2008, was unable to muster a single break point on the Berdych serve as he was defeated in little over 90 minutes.\n\nAfter being broken twice in the first set, the Swiss improved in the second but was blown away in the tie break.\n\n\"I was concentrating on my serve,\" said world number nine Berdych. \"I was serving the best I have this year, and it put a lot of pressure on his serve.\n\n\"I want to move higher so I need some better results. It's a small step this week and I'm looking forward to the next one.\"\n\nDjokovic improved his record in 2011 to 56 wins and one defeat after coming from a set down to beat Monfils.\n\n\"It was a very physical match, but I hung in there and it was a good win. It was an intense match, [with] a lot of tension,\" the Serb said after sealing his place in the last four."}