{"url": "https://www.bbc.com/sport/football/25776175", "title": "Cardiff boss Ole Gunnar Solskjaer aims to end Man City home run", "description": "Ole Gunnar Solskjaer sets his Cardiff City side the test of ending Manchester City's perfect Premier League home record.", "content": "Ole Gunnar Solskjaer has set his Cardiff City team the challenge of ending Manchester City's perfect Premier League home record.\n\nBluebirds boss Solskjaer takes his team to Etihad Stadium on Saturday.\n\nTheir opponents have the best home record in Europe's top leagues - having won all 10 games, scoring 38 goals.\n\n\"You have to go up there with the mindset of having a go and taking something from the game,\" said former Manchester United striker Solskjaer.\n\n\"We are relishing the challenge because when you go to places like Etihad Stadium and Old Trafford, you are going to be tested.\n\n\"You are going to be tested by some of the best players in the world, never mind Europe.\n\n\"And we have our own standards to live up to as well.\"\n\nSolskjaer's only previous game at Etihad Stadium ended disappointingly - with an 18-minute substitute appearance for Manchester United as they were beaten 4-1 at City in a Premier League match in March 2004.\n\nHe was never on the winning side in a Manchester derby - but he was the last United player to score at City's old Maine Road home, with a goal in a 3-1 defeat in November 2002.\n\nWhile Solskjaer acknowledges Cardiff are underdogs for this trip to Manchester, he can point to the last meeting between the sides. Under previous boss Malky Mackay, the Bluebirds pulled off a shock 3-2 victory over City in August.\n\nIn fact, Cardiff have won the last two meetings between the teams, having earned a 1-0 FA Cup fourth-round victory over City in January 1994 thanks to a Nathan Blake goal.\n\nSolskjaer said: \"You don't go up there to just finish the game off. We beat Man City at home.\n\n\"We need to ride our luck, have the ball drop our way at times but, of course, bigger surprises have happened in the world of football.\n\n\"You have to go up there with the mindset of having a go and taking something from the game.\n\n\"Our aim, as I have said before, is to be a top-10 club. We have to go to these places and take something.\"\n\nCardiff have only taken one point from their last five games as they prepare to face Manuel Pellegrini's team, who have not lost a league game for two months.\n\nThe Bluebirds' win over the 2011-12 Premier League champions was their first in the top flight since 1962.\n\nSolskjaer says the manner of that win gives Cardiff side hope but he is under no illusions of the task facing his side against Manchester City.\n\n\"They have moulded into a top, top team at the moment,\" said Solskjaer.\n\n\"I have watched them live a few times and you do sit back and admire teams that play that way.\n\n\"But we are focussed on where can we hurt them, what chances we have and what positions can we achieve.\n\n\"Set pieces, like last time, is a big weapon for us and we go up there with a positive frame of mind.\n\n\"We have been in this position so many times this season, so there is nothing new for us.\""}