{"url": "https://www.bbc.com/sport/tennis/18852503", "title": "Heather Watson wins doubles title & is new British No 1", "description": "Heather Watson wins her first WTA tour title with a doubles victory in Stanford and also becomes British number one.", "content": "Heather Watson has won her first WTA tour title with a doubles victory at the Bank of West Classic in Stanford and has also become British number one.\n\nThe 20-year-old and her New Zealand partner Marina Erakovic beat Vania King and Jarmila Gajdosova 7-5 7-6 (9-7).\n\n\"This is my first WTA title, so I'm really happy right now,\" said Watson.\n\nShe rises to 71st in the singles rankings - making her the lead Briton for the first time - with three compatriots also in the top 100.\n\nAnne Keothavong drops a place to 76th, Laura Robson is the youngest player in the top 100 at a career-high 91st and Elena Baltacha is 100th.\n\nIt is the first time Britain has had four women in the top 100 since 12 March 1991 when Jo Durie, Sara Gomer, Sarah Loosemore and Monique Javer formed the quartet.\n\nIt was Watson's first title of any description on the WTA tour and serves as ideal preparation for her Olympic campaign.\n\nShe will compete for Team GB alongside 18-year-old Laura Robson after the pair were handed a doubles wildcard.\n\nAgainst King and Gajdosova, Watson and Erakovic broke three times to win the first set before slipping behind early in the second.\n\nThey fought back to serve for the match at 5-3, only to let the lead slip and waste two match points on their opponents' delivery.\n\nBut Watson and Erakovic held firm in the tie-break to clinch victory.\n\n\"It's such a nice feeling getting to the end of the week and being the last ones here,\" the Briton added.\n\n\"We knew it wasn't going to be an easy match today - they're both great players and we knew we would really have to win it, they weren't going to give it to us.\"\n\nWatson will play this week's WTA event in Carlsbad, California, and then return to the UK.\n\nShe has been drawn to face Eleni Daniilidou of Greece in the opening round, while Keothavong meets Erakovic.\n\nIn the doubles, Watson partners Slovakia's Janette Husarova against fourth seeds Natalie Grandin and Vladimira Uhlirova, with Keothavong and American Jessica Pegula taking on Kai-Chen Chang and Noppawan Lertcheewakarn."}