{"url": "https://www.bbc.com/sport/tennis/27619379", "title": "James Ward: British number three targets tennis elite", "description": "British number three and Arsenal fanatic James Ward welcomes the pressure of following Andy Murray and continues to aim big.", "content": "James Ward is ready to embrace the Wimbledon hype, the pressure of playing in front of an expectant home crowd and the challenge of closing the gap on Andy Murray.\n\nFresh from an impressive display at the French Open, the British number three and world number 168, is adding to his own pressure. And he wouldn't have it any other way.\n\n\"You have to aim big, you can't just aim for top 100,\" 27-year-old Ward told BBC Sport a couple of days before he begins his grass-court season at the Aegon Trophy in Nottingham.\n\nWard, 27, turned pro in 2006 and reached his career-high ranking of 137 in 2012. He started playing tennis at 11 and spent four years training at the Equelite Juan Carlos Ferrero Academy, in Vilenna near Valencia, and also spent time as Rafael Nadal's hitting partner in 2009. Ward became the first British man since John Lloyd in 1973 to come through qualifying at Roland Garros. So far this year Ward has played in Australia, USA (Hawaii), USA for Davis Cup, France, Dubai, back to USA then to Panama, on to Italy, back to USA, then Germany and then France for the French Open. He is a huge Arsenal fan and delayed his departure for the French Open so he could watch the Gunners face Hull City in the FA Cup final.\n\n\"It's the thing that everyone talks about in men's tennis in Britain - getting in the top 100. Everyone craves it but that is only a start. I need to aim higher.\"\n\nWard, a Davis Cup regular, is convinced he can still achieve his goals.\n\n\"If you look at the top 100 in men's tennis, the average age is about 28-29,\" the Londoner added. \"I have plenty of time.\n\n\"Gone are the days of players breaking through at 21 and winning Grand Slams. It takes time to mature.\"\n\nThe maturity in his performance at Roland Garros was clear. Ward won three qualifying rounds to make the first round proper, with his reward a tie against 17th seed and clay-court specialist Tommy Robredo.\n\nWard took the first set in style and had chances in the second, before the Spaniard took control to win in four sets.\n\n\"I gain a lot of confidence from the run and the match against Robredo,\" Ward said.\n\n\"Qualifying for any Grand Slam is especially tough; there are big prizes at stake - in terms of money and ranking points - and people tend to raise their games. But I beat some good players and had my chances against Robredo - which was a really tough draw.\n\n\"I played well and can take a lot from it. And the experience was fantastic.\"\n\nNow the focus is firmly on the grass-court season, starting with Nottingham and then Queens and Eastbourne, before the glitz and glamour of Wimbledon.\n\nWard's 6ft 3ins frame, his big serve and fierce groundstrokes seem ideally suited to playing on grass.\n\n\"Grass helps my game but I think I play pretty well on all surfaces,\" he added. \"And having the home support is huge. It really helps. Plus it's in London so it really is a home tournament for me. It will be amazing.\"\n\nDefending champion Murray will once again be shouldering the realistic hopes of progressing beyond the first week in SW19.\n\nBut the Scot has not forgotten the struggles of trying to make his way on the tour and break into the top 100 and beyond.\n\nMurray has spoken out about those trying to make ends meet - something that resonates with Ward and something he really appreciates.\n\nWard, a huge Arsenal fan, once had to sell his season ticket to help fund his tennis.\n\n\"A lot of people still do not see that side of things so it's great of him to speak out,\" Ward said.\n\n\"He has come from it and not forgotten that, just because he has reached the top. He understands and having the profile he does, when he says something it really helps.\n\n\"From the top 50-200 it's so tight and anyone can beat anyone.\n\n\"The top guys just have the consistency. But below that level the talent is there. There are a lot of good players.\"\n\nWard's efforts in France means he had no fears about the financial impact of getting his season ticket next season.\n\nGoing back to the future The Nottingham Tennis Centre will again play host to a men's ATP World Tour event in 2015, seven years after the city last hosted the Nottingham Open. The ATP 250 - which is expected to once again be called the Nottingham Open - will be the final tournament before Wimbledon. Nottingham will also host the first event of the expanded grass-court season next year with action starting with a WTA tournament on 8 June. This year is the final year that the Aegon Trophy and Aegon Nottingham Challenge - both lower tier ATP Challenger and ITF events - will be hosted in the city. During 16 days of action, which includes the Aegon Nottingham Challenge, the Nottingham Tennis Centre will host 297 matches. It remains the only venue in the world that hosts four international tournaments - two men's and two women's - over successive weeks.\n\nIt also justified his decision to delay his trip to the French Open so he could watch his beloved Gunners in the FA Cup final.\n\nWard says watching the Gunners provides much-needed escapism away from the court.\n\n\"I go with my mates and it was great to see us win a trophy,\" said Ward, whose knowledge and enthusiasm for the north London club is clear. \"If we had bought a striker in January then we could have won the league.\n\n\"We had injuries to key players like Theo Walcott and Aaron Ramsay which affected us but if we had signed a striker then it could have been different.\"\n\nThe main London club on the horizon now is the All England Club, but before then Ward wants a good run in Nottingham.\n\n\"I would be stupid to look too far ahead,\" he said. \"It depends on draws. But I am playing well and am confident and really looking forward to the summer.\"\n\nArsenal's summer suddenly looks more settled too. Manager Arsene Wenger has signed a new contract on the back of a first trophy in nine years.\n\nAnd Ward is eager to back up his fine French Open form by breaking into the top 100 - at least."}