{"url": "https://www.bbc.com/sport/tennis/13286637", "title": "Rafael Nadal and Novak Djokovic win at Madrid Open", "description": "World number one Rafael Nadal and second seed Novak Djokovic extended their winning runs with second-round victories at the Madrid Open.", "content": "World number one Rafael Nadal and second seed Novak Djokovic extended their winning runs with second-round victories at the Madrid Open.\n\nDjokovic extended his unbeaten run to 28 matches, the best start to a season since Ivan Lendl won 29 in 1986, with a 6-3 6-4 win against Kevin Anderson.\n\nThe Swiss saved a match point with an ace in the final set tie-break, during which Lopez missed a smash when leading 5-2 and seemingly closing in on victory.\n\n\"I thought he played well,\" said Federer. \"You could see he's been playing a lot of matches and he's confident, and I'm really relieved to have come through because it wasn't easy at all.\"\n\nNadal, who is seeking his third clay court title in less than a month, did not face a single break point on his serve and converted his first match point with a forehand down the line.\n\nIt was the 24-year-old Spaniard's 35th successive victory on his favourite surface, setting up a much sterner test in the form of Argentina's Juan Martin del Potro\n\nThe former world number four and 2009 US Open champion dispatched Croat Marin Cilic 6-3 6-0, as he continued his comeback from a wrist injury.\n\n\"It's one of those matches you can win or lose and anything could happen,\" Nadal said of his much-anticipated clash with Del Potro.\n\n\"I will try to play at my top level, aggressively and with more intensity. It's also true that I am coming into the match in good form and I will try to maintain that.\n\n\"We will see who wins but the winner will take away a lot of confidence for the rest of the tournament I think.\"\n\nDel Potro admited: \"Obviously it will be one of the most difficult matches here on clay that there can be.\n\n\"I've never been capable of beating him on clay and let's see if it's tomorrow, but let me repeat that it's against the number one in the world and he's the best without a doubt on this type of surface.\"\n\nAustralian Open champion Djokovic, who has won five titles this season already, said he found the conditions unusually fast but saw off South African Anderson with relative ease.\n\nAnd he will equal Lendl's run if he beats unseeded Spaniard Guillermo Garcia-Lopez in his next match and could go on to face Nadal in the final.\n\nOnly John McEnroe in 1984 (42 wins in a row) and Bjorn Borg in 1980 (33) have enjoyed better starts to the season since 1980.\n\n\"It's a great honour and very flattering to be part of that elite but it's not my priority,\" said the 23-year-old Serb, whose last defeat came at the hands of Federer in November 2010.\n\n\"I am just taking each match at a time and hoping I can win. It's kind of a surprise but I always believed that I have the quality to beat any player.\n\n\"I am a more mature player and I have more self-belief which is very important for this level.\"\n\nTo complete a good day for the top four men, Britain's Andy Murray beat Gilles Simon 6-4 3-6 6-0.\n\nFifth-seeded Swede Robin Soderling, whose victory against Nadal in the fourth round at Roland Garros in 2009 was the Spaniard's last loss on clay, advanced with a 6-3 6-3 victory against Colombian Santiago Giraldo. Tomas Berdych, the Czech seventh seed, also progressed, beating Spanish wildcard Marcel Granollers 6-4 6-0.\n\nThere were several surprises in the women's event, as Czech 16th seed Petra Kvitova upset second seed Vera Zvonareva 6-1 6-4 to set up a quarter-final against Slovakia's Domenika Cibulkova, who beat eighth seed Maria Sharapova 7-5 6-4.\n\n\"It's never easy to play against Maria because she's a great player and a great fighter. It was not easy to finish this match today,\" said Cibulkova. \"It's a great victory for me. I'm so happy to win.\"\n\nIn the second round, Czech Lucie Safarova beat seventh seed Jelena Jankovic 6-4 4-6 7-5, and last week's Stuttgart champion Julia Goerges of Germany defeated Dinara Safina 6-4 4-6 6-4."}