{"url": "https://www.bbc.com/sport/football/29336586", "title": "Andy Carroll: Ankle injury has been 'a nightmare' for striker", "description": "West Ham striker Andy Carroll says being injured has been \"a nightmare\" but he hopes to return to training soon after ankle surgery.", "content": "West Ham striker Andy Carroll says being injured has been \"a nightmare\" but he hopes to return to training soon after undergoing an ankle operation.\n\nCarroll, 25, who had surgery in the United States in July, is running again and on track for a return in December.\n\n\"I was devastated,\" he said of being told he would be out for four months.\n\n\"The last place I want to be is in the treatment room. Watching the lads outside every day - it's a nightmare. They're doing what I want to do.\"\n\nHe was speaking as the Hammers announced more details about their move to the 54,000-capacity Olympic Stadium for the 2016-17 season.\n\nThe former Newcastle and Liverpool striker added: \"Everything is going well, and the running at this stage is earlier than expected. I've been running for the last 10 days.\"\n\nCarroll said he rolled the ankle in training during the pre-season tour of New Zealand, and torn ligaments were eventually diagnosed when club physios insisted something was not right despite three specialists in London failing to identify the problem.\n\nHe joined West Ham for a club record fee of £15m from Liverpool on a six-year contract in June 2013 after impressing during a loan spell.\n\nBut he missed the majority of 2013-14 with a heel problem - managing just 15 league appearances.\n\nThe forward, who has been capped nine times by England, said he was aware of criticism that he was injury-plagued, but remained determined to return to the first team.\n\n\"I don't really care what people say. I know I've had problems with injuries and I'm not hiding away from that. Hopefully this is the last one and I can get it out of the way,\" he said.\n\n\"Obviously the club have put a lot of faith in me, paying so much money, but I don't feel like I've let them down. It's an injury that I couldn't help but I do want to be out there and repay the faith they've had in me.\"\n\nSpeaking at the launch of the Club London hospitality scheme, West Ham vice-chairman Karren Brady said the Hammers were aiming to become a top-six club regularly playing in European competition.\n\nAsked if that was realistic, Carroll said: \"The way we are going, the players we have signed and the future with the Olympic Stadium, I don't see why we can't be up there.\"\n\nBrady said she was confident West Ham could fill the Stratford venue despite it having the capacity for 20,000 more fans than their current home at the Boleyn Ground.\n\n\"We will price it to sell out, from the most expensive hospitality to the 'kids for a quid' games,\" she said.\n\nShe hinted that the club would be unlikely to grant permission for rivals Tottenham Hotspur to groundshare for a season while they wait to move into their new stadium.\n\n\"No-one has asked us for our permission and if they did we would probably say no, depending on who it is - if you get my drift,\" she said.\n\nWest Ham hope there will be a 'digital wrap' around the multi-sport venue, with images released on Tuesday showing the acronym 'COYI' (Come on you Irons) for Hammers matchdays.\n\nWork has already started on a new club store and ticket office, while installation of a transparent roof begins next month."}